#+title: dired-compare
#+author: Your Name
#+email: you@example.com
#+language: en
#+options: ':t toc:nil author:nil email:nil num:nil title:nil
#+todo: TODO DOING | DONE
#+startup: showall

* Customization

Note that the bedrock to this package is the defintion of =dired-compare-diff-tools= where it can be extensively modified through the custom interface, for example new commands can be easily added and arguments can be added and modified for any tool of your choosing.

#+begin_src emacs-lisp :results table :colnames '("Custom variable" "Description") :exports results
  (let ((rows))
    (mapatoms
     (lambda (symbol)
       (when (and (string-match "^dired-compare-"
                                (symbol-name symbol))
                  (not (string-match "--" (symbol-name symbol)))
                  (or (custom-variable-p symbol)
                      (boundp symbol)))
         (push `(,symbol
                 ,(car
                   (split-string
                    (or (get (indirect-variable symbol)
                             'variable-documentation)
                        (get symbol 'variable-documentation)
                        "")
                    "\n")))
               rows))))
    rows)
#+end_src

#+RESULTS:
| Custom variable          | Description                                                                                        |
|--------------------------+----------------------------------------------------------------------------------------------------|
| dired-compare-diff-tools | An alist of available directory comparison tools and their shell commands with optional arguments. |

* Commands

#+BEGIN_SRC emacs-lisp :results table :colnames '("Command" "Description") :exports results
    (let ((rows))
      (mapatoms
       (lambda (symbol)
         (when (and (string-match "^dired-compare-"
                                  (symbol-name symbol))
                    (commandp symbol))
           (push `(,(car (split-string (symbol-name symbol)))
                  ,(or (documentation symbol t) ""))
                 rows))))
      rows)
#+END_SRC

#+RESULTS:
| Command                   | Description                                                     |
|---------------------------+-----------------------------------------------------------------|
| dired-compare-directories | Mark files with different file attributes in two Dired buffers. |

